In [67]:
import pandas as pd
import numpy as np

#Create Dummy Data

data={'A':[1,2,3],'B':[4,5,6],'C':[7,8,9],'D':[10,22,12]}
my_df=pd.DataFrame(data)
my_df

   A  B  C   D
0  1  4  7  10
1  2  5  8  22
2  3  6  9  12

In [75]:
data={'A':[1,2,3],'B':[4,np.nan,6],'C':[7,8,9],'D':[10,22,12]}
my_df=pd.DataFrame(data)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  22
2  3  6.0  9  12

In [69]:
#Drop Rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10

In [70]:
#Drop colum with null data
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  22
2  3  9  12

In [71]:
#Not permanent,inplace=false
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  22
2  3  NaN  9  12

In [72]:
#More than one?set Threshold
my_df.dropna(thresh=2,axis=1)

   A  C   D
0  1  7  10
1  2  8  22
2  3  9  12

In [76]:
#Replace thins with filling()
my_df.fillna(value="7")

   A    B  C   D
0  1  4.0  7  10
1  2    7  8  22
2  3  6.0  9  12

In [79]:
#the math function
my_df.fillna(value=my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  22
2  3  6.0  9  12

In [ ]:
#use min, max,sum
my_df.fillna(value=my_df['B'].max())

   A    B  C   D
0  1  4.0  7  10
1  2  6.0  8  22
2  3  6.0  9  12